---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedError
source: html/a51aa46c-d6ed-ec08-f1b8-607f7d00b9b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedError Property

"In order to find a matching part, the fitting has to be connected to a pipe."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundDueToNoPipeConnectedError { get; }
```